Autodesk.Revit.DB.FDXExportOptions.GetCustomHeaders
Gets the map of a name value pair

Autodesk.Revit.DB.FDXExportOptions.SetCustomHeaders(System.Collections.Generic.IDictionary{System.String,System.String})
Set a map of a name value pair
customHeaders:
A map of a name value pair
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FDXExportOptions.SourceFileVersionUrn
The "sourceFileVersionUrn" parameter to pass during FDX fulfillment creation.

Autodesk.Revit.DB.FDXExportOptions.FulfillmentId
The string ID of an open FDX fulfillment on the specified exchange. If non-empty, the open fulfillment will be used for export.
If empty, Revit will create a new fulfillment and close the fulfillment if export is successful.

Autodesk.Revit.DB.FDXExportOptions.LogOutputPath
Path to write JSON log file of FDX fulfillment. Should have *.json extension. No log is written if path is empty.

Autodesk.Revit.DB.FDXExportOptions.LogVerbosity
Value specifying the level of FDX logging - see FDXLogVerbosity.

Autodesk.Revit.DB.FDXExportOptions.#ctor
Constructs a new instance of FDXExportOptions with default values of all properties.

Autodesk.Revit.DB.FDXExportOptions
The export options used for publishing to an FDX exchange.